Revit 2027 API
ValidationStatus Enumeration
 Lists the validation type of the fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ValidationStatus
Public Enumeration ValidationStatus
public enum class ValidationStatus
type ValidationStatus
Members
Member name | Value | Description
InvalidDimensions | 1 |  The part has invalid dimensions.
NoMaterial | 2 |  The part has no material being specified.
Valid | 0 |  The part is valid to fabrication.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace